forAIstudy/data/AU_testData.json

{
  "status": {
    "Approved": "Approved",
    "PendingApproval": "Pending Approval",
    "PartialApproved": "Partial Approved",
    "PendingRelease": "Pending Release",
    "PendingVerification": "Pending Verification",
    "PartialCompleted": "Partial Completed",
    "Received": "Received",
    "Completed": "Completed",
    "Saved": "Saved",
    "Submitted": "Submitted",
    "BankRejected": "Bank Rejected",
    "Rejected": "Rejected",
    "Failed": "Failed",
    "Cancelled": "Cancelled"
  },
  "paymentType": {
    "AU_ACT": "AU - Account Transfer",
    "AU_LVT": "AU - Low Value Domestic Payment",
    "AU_HVT": "AU - High Value Domestic Payments",
    "AU_BPAY": "AU - Bulk Payment",
    "AU_TT": "AU - Telegraphic Transfer",
    "AU_PYRL": "AU - Payroll",
    "AU_MPYRL": "AU - Management Payroll",
    "AU_ICT": "Intra Company Transfer",
    "AU_CBA": "Cross Border ACH",
    "AU_Bill": "AU - Bill Payment"
  },
  "AccountTransfer": {
    "UAT": {
      "loginCompanyId": "AUCUST01",
      "loginUserId": "AUCUST01U01",
      "verifyUserId": "AUCUST01U02",
      "fromAccount": "9000640005",
      "fromAccountUpload": "9000640005",
      "payeeBankID": "642000",
      "payeeBankIDEdit": "013583",
      "fileName": "AU_UploadFile/AU_ACT_UFF_UAT.txt",
      "amountUpload2": "100",
      "existingTemplate": "ACTExitsingTemplate"
    },
    "SIT": {
      "loginCompanyId": "AUTOAU01",
      "loginUserId": "AUTOAU01S06",
      "verifyUserId": "AUTOAU01S04",
      "fromAccount": "9876543210",
      "fromAccountUpload": "9876543210",
      "payeeBankID": "642000",
      "payeeBankIDEdit": "013583",
      "fileName": "AU_UploadFile/AU_ACT_UFF_SIT.txt",
      "amountUpload2": "11",
      "existingTemplate": "TTNameyso03"
    },
    "Country": "AUSTRALIA",
    "amount1": "20",
    "amount2": "9,400",
    "amountEdit": "30",
    "amountVerify": "4,000",
    "amountUpload": "100",
    "amountA2": "9,400",
    "ACTExistingPayee": "ACTExistingPayee",
    "newPayeeName": "NewPayeeName",
    "newPayeeNickname": "newPayeeNickname",
    "newPayeeNameUpload": "BetsyCollectionDBS",
    "newPayeeAdd1": "newPayeeAdd1",
    "newPayeeAdd2": "newPayeeAdd2",
    "newPayeeAdd3": "newPayeeAdd3",
    "newPayeeNameEdit": "NewPayeeNameEdit",
    "newPayeeAcctNumber": "123456000001",
    "ReferenceForPayee": "ReferenceForPayee",
    "paymentDetails": "paymentDetails",
    "amountErrorTip": "Amount is invalid.",
    "bsbCode": "123456",
    "bsbCodeEdit": "234567",
    "batchId": "234561",
    "emailIdO": "1111111@dbs.com",
    "emailId1": "2222222@dbs.com",
    "emailId2": "3333333@dbs.com",
    "emailId3": "4444444@dbs.com",
    "emailId4": "5555555@dbs.com",
    "message": "message detail",
    "challengeResponse": "Response",
    "rejectReason": "Reject Reason Details",
    "fileType": "ALL",
    "fileFormat": "Universal File Format",
    "approvalOptionByTxn": "By Transaction",
    "labelNoInformationDisplay": "No information to display",
    "errorMessage": "One or more of the fields below have not been properly filled up. Please amend and submit again."
  },
  "TelegraphicTransfer": {
    "UAT": {
      "loginCompanyId": "AUCUST01",
      "loginUserId": "AUCUST01U01",
      "verifyUserId": "AUCUST01U02",
      "fromAccount": "9000640005",
      "fromAccountUpload": "9000640005",
      "toAccountUpload": "443444387",
      "payeeBankID": "CPANAU21XXX",
      "payeeBankIDEdit": "ABWHAU21XXX",
      "fileName": "AU_UploadFile/AU_TT_UFF_UAT.txt",
      "existingTemplate": "TTExistingTemplate"
    },
    "SIT": {
      "loginCompanyId": "AUTOAU01",
      "loginUserId": "AUTOAU01S06",
      "verifyUserId": "AUTOAU01S04",
      "fromAccount": "9876543210",
      "fromAccountUpload": "9876543210",
      "toAccountUpload": "443444387",
      "payeeBankID": "3 BANKEN",
      "payeeBankIDEdit": "AIBC ANGLO IRISH",
      "fileName": "AU_UploadFile/AU_TT_UFF_SIT.txt",
      "existingTemplate": "TTNamezrph1"
    },
    "maxAmount": "500,000,000",
    "moreThanMaxAmount": "500,000,001",
    "amount": "20",
    "amountEdit": "30",
    "amountUpload": "23.74",
    "amountUpload2": "7.91",
    "amountVerify": "4,000",
    "amountA2": "9,400",
    "bulkExistingPayee": "TTExistingPayee",
    "newPayeeName": "NewPayeeName",
    "newPayeeNickname": "newPayeeNickname",
    "newPayeeNameUpload": "JANETEST1",
    "newPayeeAdd1": "newPayeeAdd1",
    "newPayeeAdd2": "newPayeeAdd2",
    "newPayeeAdd3": "newPayeeAdd3",
    "payeeLocation":"GRENADA",
    "townCity":"Town,City",
    "postalCode":"postalCode123",
    "streetName":"street Name",
    "buildingNum":"building894",
    "buildingName":"buildname333",
    "floor":"floor 33",
    "room":"room 09",
    "department":"department123",
    "subDepartment":"subDepartment123",
    "countrySubDivsion":"countrySubDivsion123",
    "townLocationName":"townLocationName234",
    "districtName":"districtName567",
    "newPayeeNameEdit": "NewPayeeNameEdit",
    "newPayeeAcctNumber": "123456000001",
    "newPayeeBankName": "newPayeeBankName",
    "newPayeeBankADDR1": "newPayeeBankADDR1",
    "newPayeeBankADDR2": "newPayeeBankADDR2",
    "ReferenceForPayee": "ReferenceForPayee",
    "paymentDetails": "paymentDetails",
    "amountErrorTip": "Amount is invalid.",
    "bsbCode": "123456",
    "bsbCodeEdit": "234567",
    "payeeBankId": "013992",
    "batchId": "234561",
    "emailIdO": "1111111@dbs.com",
    "emailId1": "2222222@dbs.com",
    "emailId2": "3333333@dbs.com",
    "emailId3": "4444444@dbs.com",
    "emailId4": "5555555@dbs.com",
    "message": "message detail",
    "challengeResponse": "22222222",
    "rejectReason": "Reject Reason Details",
    "fileType": "ALL",
    "fileFormat": "Universal File Format",
    "approvalOptionByTxn": "By Transaction",
    "labelNoInformationDisplay": "No information to display",
    "pMChllengeText": "you are receiving the Challenge by SMS because you are the 1st approver",
    "mChllengeText": "you are receiving the Challenge by SMS because you are trying to approve a transaction that you have created",
    "errorMessage": "One or more of the fields below have not been properly filled up. Please amend and submit again."
  },
  "IntraCompanyTransfer": {
    "UAT": {
      "loginCompanyId": "AUCUST01",
      "loginUserId": "AUCUST01U03",
      "verifyUserId": "AUCUST01U04",
      "fromAccount": "9000640005",
      "fromAccountUpload":"9000640005",
      "toAccountUpload": "89009994111",
      "toAccount": "89009994111",
      "toAccountWithFCY": "7000009877",
      "fileName": "AU_UploadFile/AU_ICT_UFF_UAT.txt",
      "existingTemplate": "ExistingICTTEMPLTE"
    },
    "SIT": {
      "loginCompanyId": "AUTOAU01",
      "loginUserId": "AUTOAU01S12",
      "verifyUserId": "AUTOAU01S22",
      "fromAccount": "9876543210",
      "fromAccountUpload": "9876543210",
      "toAccountUpload": "9876543210",   
      "toAccount": "912345678",
      "toAccountWithFCY": "9876543211",
      "fileName": "AU_UploadFile/AU_ICT_UFF_SIT.txt",
      "existingTemplate": "ICTTEMPLAT FOR AUTO"
    },
    "amountA1": "10",
    "amountA2": "9,400",
    "amountV": "100",
    "amountUpload": "100",
    "amountVerify": "2,000",
    "editAmount": "20",
    "additionNote": "messageToOrderingBank",
    "transactionNote": "transactionNote",
    "fileType": "ALL",
    "fileFormat": "Universal File Format",
    "approvalOptionByTxn": "By Transaction"
  },
  "CrossBorder": {
    "UAT": {
      "login": {
        "loginCompanyId": "AUCUST01",
        "loginUserId": "AUCUST01U03",
        "verifyUserId": "AUCUST01U04"
      },
      "fromAccount": "9000640005",
      "payeeBankID": "AFGUAFKAXXX",
      "payeeBankIDEdit": "AFABAFK1XXX",
      "paymentCountry": "AFGHANISTAN",
      "fileService": {
        "fileType": "Cross Border ACH",
        "fileFormat": "Universal File Format",
        "fileName": "AU_UploadFile/AU_CrossBorderACH_UFF_UAT.txt",
        "approvalCurrency": "MRU"
      },
      "amountVerify": "90,000",
      "amountVerifyIX": "90000",
      "existingTemplate": ""
    },
    "SIT": {
      "login": {
        "loginCompanyId": "AUTOAU01",
        "loginUserId": "AUTOAU01S20",
        "verifyUserId": "AUTOAU01S21"
      },
      "fromAccount": "9876543210",
      "paymentCountry": "AFGHANISTAN",
      "payeeBankID": "AFGAN UNITED",
      "payeeBankIDEdit": "AFGHANISTAN INTERNATIONA",
      "fileService": {
        "fileType": "Cross Border ACH",
        "fileFormat": "Universal File Format",
        "fileName": "AU_UploadFile/AU_CrossBorderACH_UFF_SIT.txt"
      },
      "amountVerify": "4,500",
      "amountVerifyIX": "4500",
      "existingTemplate": ""
    },
    "debitType": "Itemized Debit",
    "amount": "20",
    "amountEdit": "30",
    "amountA2": "9,400",
    "amountA2IX": "9400",
    "paymentCountryINTL": "CHILE",
    "payeeNameINTL": "AUCBAPayee",
    "payeeNameEdit": "AUCBAPayeeEdit",
    "payeeNameUpload": "ROYAL BANK1ROYAL BANK1ROYAL BA12345",
    "accountNumberINTL": "11112222",
    "amountINTL": "1",
    "bankName": "bankName",
    "bankAddr1": "bankAddr1",
    "newPayeeRoutingCode": "3423423",
    "newPayeeAcctNumber": "3453433",
    "payeePurpose1": "payee Purpose1",
    "payeeDetail1": "payee Detail1",
    "responseCode": "123334",
    "rejectReason": "reject detail reason",
    "labelNoInformationDisplay": "No information to display"
  },
  "BulkPayment": {
    "UAT": {
      "loginCompanyId": "AUCUST01",
      "loginUserId": "AUCUST01U01",
      "verifyUserId": "AUCUST01U02",
      "fromAccount": "9000640005",
      "fromAccountUpload": "9000640005",
      "payeeBankID": "642000",
      "payeeBankIDEdit": "013583",
      "fileName": "AU_UploadFile/AU_BulkPayment_UFF_UAT.txt",
      "existingTemplate": "existingBulkTemplate"
    },
    "SIT": {
      "loginCompanyId": "AUTOAU01",
      "loginUserId": "AUTOAU01S03",
      "verifyUserId": "AUTOAU01S23",
      "fromAccount": "9876543210",
      "fromAccountUpload": "9876543210",
      "payeeBankID": "642000",
      "payeeBankIDEdit": "013583",
      "fileName": "AU_UploadFile/AU_BulkPayment_UFF_SIT.txt",
      "existingTemplate": "BULKr8rw1"
    },
    "maxAmount": "500,000,000",
    "moreThanMaxAmount": "500,000,001",
    "amount": "20",
    "amountEdit": "30",
    "amountUpload": "10",
    "amountVerify": "2,000",
    "amountVerifyIX": "2000",
    "amountA2": "9,400",
    "amountA2IX": "9400",
    "bulkExistingPayee": "PayrollExistingPayee",
    "newPayeeName": "NewPayeeName",
    "newPayeeNickname": "newPayeeNickname",
    "newPayeeNameUpload": "JANETEST1",
    "newPayeeNameEdit": "NewPayeeNameEdit",
    "newPayeeAcctNumber": "123456000001",
    "ReferenceForPayee": "ReferenceForPayee",
    "paymentDetails": "paymentDetails",
    "amountErrorTip": "Amount is invalid.",
    "bsbCode": "123456",
    "bsbCodeEdit": "234567",
    "fileType": "Bulk Payment",
    "fileFormat": "Universal File Format",
    "approvalOptionByTxn": "By Transaction",
    "batchId": "234561",
    "emailIdO": "1111111@dbs.com",
    "emailId1": "2222222@dbs.com",
    "emailId2": "3333333@dbs.com",
    "emailId3": "4444444@dbs.com",
    "emailId4": "5555555@dbs.com",
    "message": "message detail",
    "challengeResponse": "22222222",
    "rejectReason": "Reject Reason Details",
    "labelNoInformationDisplay": "No information to display",
    "errorMessage": "One or more of the fields below have not been properly filled up. Please amend and submit again."
  },
  "PayrollPayment": {
    "UAT": {
      "loginCompanyId": "AUCUST01",
      "loginUserId": "AUCUST01U01",
      "verifyUserId": "AUCUST01U02",
      "fromAccount": "9000640005",
      "fromAccountUpload": "9000640005",
      "payeeBankID": "642000",
      "payeeBankIDEdit": "013583",
      "fileName": "AU_UploadFile/AU_PayrollPayment_UFF_UAT.txt",
      "existingTemplate": "ExistingPayrollTemplate"
    },
    "SIT": {
      "loginCompanyId": "AUTOAU01",
      "loginUserId": "AUTOAU01S03",
      "verifyUserId": "AUTOAU01S23",
      "fromAccount": "9876543210",
      "fromAccountUpload": "9876543210",
      "payeeBankID": "642000",
      "payeeBankIDEdit": "013583",
      "fileName": "AU_UploadFile/AU_PayrollPayment_UFF_SIT.txt",
      "existingTemplate": "AUPRma8iw "
    },
    "maxAmount": "500,000,000",
    "moreThanMaxAmount": "500,000,001",
    "amount": "20",
    "amountEdit": "50",
    "amountUpload": "100",
    "amountVerify": "2,000",
    "amountVerifyIX": "2000",
    "amountA2": "9,400",
    "amountA2IX": "9400",
    "bulkExistingPayee": "PayrollExistingPayee",
    "newPayeeName": "NewPayeeName",
    "newPayeeNickname": "newPayeeNickname",
    "newPayeeNameUpload": "Betsy BPY NonDBS",
    "newPayeeNameEdit": "NewPayeeNameEdit",
    "newPayeeAcctNumber": "123456000001",
    "ReferenceForPayee": "ReferenceForPayee",
    "paymentDetails": "paymentDetails",
    "amountErrorTip": "Amount is invalid.",
    "bsbCode": "123456",
    "bsbCodeEdit": "234567",
    "batchId": "234561",
    "emailIdO": "1111111@dbs.com",
    "emailId1": "2222222@dbs.com",
    "emailId2": "3333333@dbs.com",
    "emailId3": "4444444@dbs.com",
    "emailId4": "5555555@dbs.com",
    "fileType": "Payroll",
    "fileFormat": "Universal File Format",
    "approvalOptionByTxn": "By Transaction",
    "message": "message detail",
    "challengeResponse": "22222222",
    "rejectReason": "Reject Reason Details",
    "labelNoInformationDisplay": "No information to display",
    "errorMessage": "One or more of the fields below have not been properly filled up. Please amend and submit again."
  },
  "MPayrollPayment": {
    "UAT": {
      "loginCompanyId": "AUCUST01",
      "loginUserId": "AUCUST01U03",
      "verifyUserId": "AUCUST01U04",
      "fromAccount": "9000640005",
      "payeeBankID": "642000",
      "payeeBankIDEdit": "013583",
      "fileName": "AU_UploadFile/AU_MPayrollPayment_UFF_UAT.txt",
      "fromAccountUpload": "9000640005",
      "existingTemplate": "ExistingMpayrollTemplate"
    },
    "SIT": {
      "loginCompanyId": "AUTOAU01",
      "loginUserId": "AUTOAU01S12",
      "verifyUserId": "AUTOAU01S22",
      "fromAccount": "9876543210",
      "payeeBankID": "642000",
      "payeeBankIDEdit": "013583",
      "fileName": "AU_UploadFile/AU_MPayrollPayment_UFF_SIT.txt",
      "fromAccountUpload": "9876543210",
      "existingTemplate": "AUMPc1rnj "
    },
    "amount": "20",
    "amountEdit": "50",
    "amountUpload": "100",
    "amountVerify": "2,000",
    "amountVerifyIX": "2000",
    "amountA2": "9,400",
    "amountA2IX": "9400",
    "bulkExistingPayee": "MPayrollExistingPayee",
    "newPayeeName": "NewPayeeName",
    "newPayeeNickname": "newPayeeNickname",
    "newPayeeNameEdit": "NewPayeeNameEdit",
    "newPayeeNameUpload": "Betsy BPY NonDBS",
    "newPayeeAcctNumber": "123456000001",
    "ReferenceForPayee": "ReferenceForPayee",
    "paymentDetails": "paymentDetails",
    "amountErrorTip": "Amount is invalid.",
    "bsbCode": "123456",
    "bsbCodeEdit": "234567",
    "batchId": "234561",
    "emailIdO": "1111111@dbs.com",
    "emailId1": "2222222@dbs.com",
    "emailId2": "3333333@dbs.com",
    "emailId3": "4444444@dbs.com",
    "emailId4": "5555555@dbs.com",
    "message": "message detail",
    "fileType": "ALL",
    "fileFormat": "Universal File Format",
    "approvalOptionByTxn": "By Transaction",
    "challengeResponse": "22222222",
    "rejectReason": "Reject Reason Details",
    "labelNoInformationDisplay": "No information to display",
    "errorMessage": "One or more of the fields below have not been properly filled up. Please amend and submit again."
  },
  "HVTPayment": {
    "UAT": {
     "loginCompanyId": "AUCUST01",
      "loginUserId": "AUCUST01U03",
      "verifyUserId": "AUCUST01U04",
      "fromAccount": "9000640005",
      "payeeBankID": "014125",
      "fileName": "AU_UploadFile/AU_HighValueDomestic_UFF_UAT.txt",
      "fromAccountUpload": "9000640005",
      "existingTemplate": ""
    },
    "SIT": {
      "loginCompanyId": "AUTOAU01",
      "loginUserId": "AUTOAU01S02",
      "verifyUserId": "AUTOAU01S05",
      "fromAccount": "9876543210",
      "payeeBankID": "242025",
      "fileName": "AU_UploadFile/AU_HighValueDomestic_UFF_SIT.txt",
      "fileName2": "AU_UploadFile/AU_HighValueDomestic_UFF_SIT.txt",
      "fromAccountUpload": "9876543210",
      "existingTemplate": "existingHVTTemplate"
    },
    "Country": "AUSTRALIA",
    "amountV": "1,500",
    "amountA1": "9,400",
    "amountA2": "500",
    "editAmount": "300",
    "maxAmount": "500,000,000",
    "moreThanMaxAmount": "500,000,001",
    "amount": "200,000,000",
    "existingPayee": "HVT01PAYEE",
    "existingTemplate": "hvttemp01",
    "newPayeeName": "hvtNewPayeeName01",
    "newPayeeNickname": "newPayeeNickname",
    "uploadNewPayeeName": "BetsyCollectionDBS",
    "newPayeeAdd1": "newPayeeAdd1",
    "newPayeeAdd2": "newPayeeAdd2",
    "newPayeeAdd3": "newPayeeAdd3",
    "payeeBankID": "014125",
    "paymentDetails": "Payment details to the payee bank",
    "newPayeeAcctNumber": "123456001",
    "fileType": "ALL",
    "fileFormat": "Universal File Format",
    "currency": "AUD",
    "approvalOptionByTxn": "By Transaction",
    "amountUpload": "100",
    "rejectReason": "rejectreason"
  },
  "LVTPayment": {
    "UAT": {
      "loginCompanyId": "AUCUST01",
      "loginUserId": "AUCUST01U03",
      "verifyUserId": "AUCUST01U04",
      "fromAccount": "9000640005",
      "fromAccountUpload": "9000640005",
      "payeeBankID": "242050",
      "existingTemplate": "existingLVTTemplate"
    },
    "SIT": {
      "loginCompanyId": "AUTOAU01",
      "loginUserId": "AUTOAU01S02",
      "verifyUserId": "AUTOAU01S05",
      "fromAccount": "9876543210",
      "fromAccountUpload": "9876543210",
      "payeeBankID": "242050",
      "existingTemplate": "AULVT8zjfr91367"
    },
    "Country": "AUSTRALIA",
    "existingPayee": "AUTOLVTPayee",
    "newPayeeName": "NewPayeeName",
    "newPayeeNickname": "newPayeeNickname",
    "newPayeeAdd1": "newPayeeAdd1",
    "newPayeeAdd2": "newPayeeAdd2",
    "newPayeeAdd3": "newPayeeAdd3",
    "newPayeeAcctNumber": "123456000",
    "paymentDetails": "paymentDetails",
    "amount": "20",
    "amountEdit": "30",
    "amountVerify": "4,000",
    "amountUpload": "100",
    "amountA2": "9,400",
    "newPayeeNameEdit": "NewPayeeNameEdit",
    "ReferenceForPayee": "ReferenceForPayee",
    "amountErrorTip": "Amount is invalid.",
    "bsbCode": "242050",
    "bsbCodeEdit": "234567",
    "fileType": "ALL",
    "fileFormat": "Universal File Format",
    "approvalOptionByTxn": "By Transaction",
    "emailIdO": "1111111@dbs.com",
    "emailId1": "2222222@dbs.com",
    "emailId2": "3333333@dbs.com",
    "emailId3": "4444444@dbs.com",
    "emailId4": "5555555@dbs.com",
    "message": "message detail",
    "challengeResponse": "22222222",
    "rejectReason": "Reject Reason Details",
    "labelNoInformationDisplay": "No information to display",
    "errorMessage": "One or more of the fields below have not been properly filled up. Please amend and submit again."
  },
  "PaymentReport": {
    "UAT": {
     "loginCompanyId": "AUCUST01",
      "loginUserId": "AUCUST01U01",
      "account": "9000640005 Name - 9000640005 - AUD",
      "accountNotInclude": "89009994111 Name - 89009994111 - AUD"
    },
    "SIT": {
      "loginCompanyId": "AUTOAU01",
      "loginUserId": "AUTOAU01S06",
      "account": "001-001312-2 - 9876543210 - AUD",
      "accountNotInclude": "912345678Name - 912345678 - AUD"
    },
    "usage": "Shared",
    "daily": "Evening (6PM-8PM)",
    "deliverySchedule": "Daily",
    "deliveryOneOff": "One-off / ad-hoc",
    "password": "123456",
    "confirmPassword": "123456",
    "remarks": "remarks",
    "payeeReference": "payeeReference",
    "payeeName": "payeeName"
  },
  "BillPayment": {
    "UAT": {
     "loginCompanyId": "AUCUST01",
      "loginUserId": "AUCUST01U03",
      "verifyUserId": "AUCUST01U04",
      "debitAccount": "9000640005",
      "editDebitAccount":"89009994111",
      "debitAccountForReject":"89009994111",
      "billCode":"93823",
      "EditbillCode":"93880",
      "CustomerReference": "613295255",
      "editBillReference":"713200085114",
      "viewBillerName":"APIBCD SERVICES AV5",
      "viewBillerNameEdit":"APIBCD SERVICES AV12"


    },
    "SIT": {
      "loginCompanyId": "AUTOAU01",
      "loginUserId": "AUTOAU01S20",
      "verifyUserId": "AUTOAU01S19",
      "debitAccount": "9876543211",
      "editDebitAccount":"912345678",
      "debitAccountForReject":"912345678",
      "billCode":"1234567890",
      "EditbillCode":"9988776655",
      "CustomerReference": "98765432109876543210",
      "editBillReference":"20241111",
      "viewBillerName":"TYALGUM HOODLUMS"
    },
   
  
    "amount": "2000",
    "viewAmountValue": "2,000.00",
    "amountEdit": "3000",
    "viewamountEdit": "3,000.00",
    "BillercodeNum":"1234567890",
    "successmsg1":"Biller's CRN exists.",
    "successmsg2":"Amount entered is also within biller's payment limits.",
    "viewBillerName":"TYALGUM HOODLUMS",
    "rejectReason":"TEST REJECT REASON"
  },

  "Beneficiary": {
    "payeeLocation":"ALBANIA",
    "townCity":"Town,City",
    "streetName":"street Name",
    "newPayeeAdd1": "newPayeeAdd1",
    "newPayeeAdd2": "newPayeeAdd2",
    "postalCode":"postalCode123",
    "editPayeeLocation":"AFGHANISTAN",
    "editTownCity":"Edit Town City",
    "buildingNum":"building894",
    "buildingName":"buildname333",
    "floor":"floor 33",
    "room":"room 09",
    "department":"department123",
    "subDepartment":"subDepartment123",
    "countrySubDivsion":"countrySubDivsion123",
    "townLocationName":"townLocationName234",
    "districtName":"districtName567"
  }
}